# Exploring London's Travel Network

![tower bridge](london.jpg)

London, or as the Romans called it "Londonium"! Home to [over 8.5 million residents](https://www.ons.gov.uk/peoplepopulationandcommunity/populationandmigration/populationestimates/bulletins/populationandhouseholdestimatesenglandandwales/census2021unroundeddata#population-and-household-estimates-england-and-wales-data) who speak over [300 languages](https://web.archive.org/web/20080924084621/http://www.cilt.org.uk/faqs/langspoken.htm). While the City of London is a little over one square mile (hence its nickname "The Square Mile"), Greater London has grown to encompass 32 boroughs spanning a total area of 606 square miles! 

![underground train leaving a platform](tube.jpg)

Given the city's roads were originally designed for horse and cart, this area and population growth has required the development of an efficient public transport system! Since the year 2000, this has been through the local government body called **Transport for London**, or *TfL*, which is managed by the London Mayor's office. Their remit covers the London Underground, Overground, Docklands Light Railway (DLR), buses, trams, river services (clipper and [Emirates Airline cable car](https://en.wikipedia.org/wiki/London_cable_car)), roads, and even taxis.

The Mayor of London's office make their data available to the public [here](https://data.london.gov.uk/dataset). In this project, you will work with a slightly modified version of a dataset containing information about public transport journey volume by transport type. 

The data has been loaded into a **Snowflake** database called `TFL` with a single table called `JOURNEYS`, including the following data:

## TFL.JOURNEYS

| Column | Definition | Data type |
|--------|------------|-----------|
| `MONTH`| Month in number format, e.g., `1` equals January | `INTEGER` |
| `YEAR` | Year | `INTEGER` |
| `DAYS` | Number of days in the given month | `INTEGER` |
| `REPORT_DATE` | Date that the data was reported | `DATE` |
| `JOURNEY_TYPE` | Method of transport used | `VARCHAR` |
| `JOURNEYS_MILLIONS` | Millions of journeys, measured in decimals | `FLOAT` |

Note that *in Snowflake all databases, tables, and columns are **upper case*** by default.

You will execute SQL queries to answer three questions, as listed in the instructions.

In [1]:
# import necessary libraries
import pymysql
import pandas as pd
from sqlalchemy import create_engine
import os

In [4]:
# Creating a connection between Python and MySql
password = os.environ.get("Password")
connection = pymysql.connect(host="localhost", user="root", password=password, db="datacamp_projects")

In [5]:
# create sqlalchemy engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}".format(
                        user="root",
                        pw=password,
                        db="datacamp_projects"))

In [6]:
pd.read_sql_query("SELECT * FROM tfl_journeys_final LIMIT 5", con=engine)

   month  year  days report_date       journey_type  journeys_millions
0      1  2010    31  06/30/2010  Underground & DLR          96.836391
1      2  2010    28  06/30/2010  Underground & DLR          90.330504
2      3  2010    31  06/30/2010  Underground & DLR          90.038014
3      4  2010    30  09/30/2010  Underground & DLR          92.544093
4      5  2010    31  09/30/2010  Underground & DLR          88.662911

### Question 1) 
What are the most popular transport types, measured by the total number of journeys? The output should contain two columns, 1) JOURNEY_TYPE and 2) TOTAL_JOURNEYS_MILLIONS, and be sorted by the second column in descending order.

In [10]:
#-- most_popular_transport_types

query_1 = """
SELECT journey_type, SUM(JOURNEYS_MILLIONS) AS TOTAL_JOURNEYS_MILLIONS 
    FROM tfl_journeys_final
    GROUP BY JOURNEY_TYPE
    ORDER BY TOTAL_JOURNEYS_MILLIONS DESC"""

In [11]:
pd.read_sql_query(query_1, con=engine)

        journey_type  TOTAL_JOURNEYS_MILLIONS
0                Bus             24905.193947
1  Underground & DLR             15020.466544
2         Overground              1666.845666
3           TfL Rail               411.313421
4               Tram               314.689875
5   Emirates Airline                14.583718

## Question 2)
Which five months and years were the most popular for the Emirates Airline? Return an output containing MONTH, YEAR, and JOURNEYS_MILLIONS, with the latter rounded to two decimal places and aliased as ROUNDED_JOURNEYS_MILLIONS. Exclude null values

In [13]:
# emirates_airline_popularity
query_2 = """SELECT MONTH, YEAR, ROUND(SUM(JOURNEYS_MILLIONS), 2) AS ROUNDED_JOURNEYS_MILLIONS
FROM tfl_journeys_final
WHERE JOURNEY_TYPE = 'Emirates Airline' AND JOURNEYS_MILLIONS IS NOT NULL
GROUP BY MONTH, YEAR
ORDER BY ROUNDED_JOURNEYS_MILLIONS DESC
LIMIT 5"""

In [14]:
pd.read_sql_query(query_2, con=engine)

   MONTH  YEAR  ROUNDED_JOURNEYS_MILLIONS
0      5  2012                       0.53
1      6  2012                       0.38
2      4  2012                       0.24
3      5  2015                       0.19
4      5  2013                       0.19

## Question 3)
Find the five years with the lowest volume of Underground & DLR journeys, saving as least_popular_years_tube. The results should contain the columns YEAR, JOURNEY_TYPE, and TOTAL_JOURNEYS_MILLIONS

In [15]:
#-- least_popular_years_tube
query_3 = """SELECT YEAR, JOURNEY_TYPE, SUM(JOURNEYS_MILLIONS) AS TOTAL_JOURNEYS_MILLIONS
FROM tfl_journeys_final
WHERE JOURNEY_TYPE = 'Underground & DLR'
GROUP BY YEAR, JOURNEY_TYPE
ORDER BY TOTAL_JOURNEYS_MILLIONS ASC
LIMIT 5"""

In [16]:
pd.read_sql_query(query_3, con=engine)

   YEAR       JOURNEY_TYPE  TOTAL_JOURNEYS_MILLIONS
0  2020  Underground & DLR               310.179316
1  2021  Underground & DLR               748.452544
2  2022  Underground & DLR              1064.859009
3  2010  Underground & DLR              1096.145588
4  2011  Underground & DLR              1156.647654